CAM 控制台删除group 再次apply 测试
``` 
terraform apply
tencentcloud_cam_group.example: Refreshing state... [id=99728]
tencentcloud_cam_policy.example: Refreshing state... [id=29375879]
tencentcloud_cam_role.example: Refreshing state... [id=4611686018427989452]
tencentcloud_cam_user.example: Refreshing state... [id=example]
tencentcloud_cam_role_policy_attachment.example: Refreshing state... [id=4611686018427989452#29375879]
tencentcloud_cam_user_policy_attachment.example: Refreshing state... [id=example#29375879]
tencentcloud_cam_group_policy_attachment.example: Refreshing state... [id=99728#29375879]
tencentcloud_cam_group_membership.example: Refreshing state... [id=99728]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_cam_group.example will be created
  + resource "tencentcloud_cam_group" "example" {
      + create_time = (known after apply)
      + id          = (known after apply)
      + name        = "example"
      + remark      = "example"
    }

  # tencentcloud_cam_group_membership.example will be created
  + resource "tencentcloud_cam_group_membership" "example" {
      + group_id = (known after apply)
      + id       = (known after apply)
      + user_ids = [
          + "example",
        ]
    }

  # tencentcloud_cam_group_policy_attachment.example will be created
  + resource "tencentcloud_cam_group_policy_attachment" "example" {
      + create_mode = (known after apply)
      + create_time = (known after apply)
      + group_id    = (known after apply)
      + id          = (known after apply)
      + policy_id   = "29375879"
      + policy_name = (known after apply)
      + policy_type = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

tencentcloud_cam_group.example: Creating...
tencentcloud_cam_group.example: Creation complete after 3s [id=99729]
tencentcloud_cam_group_policy_attachment.example: Creating...
tencentcloud_cam_group_membership.example: Creating...
tencentcloud_cam_group_policy_attachment.example: Creation complete after 3s [id=99729#29375879]
tencentcloud_cam_group_membership.example: Creation complete after 3s [id=99729]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
```

CAM 控制台删除policy 再次apply 测试
```
 terraform apply
tencentcloud_cam_policy.example: Refreshing state... [id=29375879]
tencentcloud_cam_group.example: Refreshing state... [id=99729]
tencentcloud_cam_user.example: Refreshing state... [id=example]
tencentcloud_cam_role.example: Refreshing state... [id=4611686018427989452]
tencentcloud_cam_user_policy_attachment.example: Refreshing state... [id=example#29375879]
tencentcloud_cam_role_policy_attachment.example: Refreshing state... [id=4611686018427989452#29375879]
tencentcloud_cam_group_membership.example: Refreshing state... [id=99729]
tencentcloud_cam_group_policy_attachment.example: Refreshing state... [id=99729#29375879]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_cam_group_policy_attachment.example will be created
  + resource "tencentcloud_cam_group_policy_attachment" "example" {
      + create_mode = (known after apply)
      + create_time = (known after apply)
      + group_id    = "99729"
      + id          = (known after apply)
      + policy_id   = (known after apply)
      + policy_name = (known after apply)
      + policy_type = (known after apply)
    }

  # tencentcloud_cam_policy.example will be created
  + resource "tencentcloud_cam_policy" "example" {
      + create_time = (known after apply)
      + document    = jsonencode(
            {
              + statement = [
                  + {
                      + action   = [
                          + "name/sts:AssumeRole",
                        ]
                      + effect   = "allow"
                      + resource = [
                          + "*",
                        ]
                    },
                  + {
                      + action   = [
                          + "name/cos:PutObject",
                        ]
                      + effect   = "allow"
                      + resource = [
                          + "*",
                        ]
                    },
                ]
              + version   = "2.0"
            }
        )
      + id          = (known after apply)
      + name        = "example"
      + type        = (known after apply)
      + update_time = (known after apply)
    }

  # tencentcloud_cam_role_policy_attachment.example will be created
  + resource "tencentcloud_cam_role_policy_attachment" "example" {
      + create_mode = (known after apply)
      + create_time = (known after apply)
      + id          = (known after apply)
      + policy_id   = (known after apply)
      + policy_name = (known after apply)
      + policy_type = (known after apply)
      + role_id     = "4611686018427989452"
    }

  # tencentcloud_cam_user_policy_attachment.example will be created
  + resource "tencentcloud_cam_user_policy_attachment" "example" {
      + create_mode = (known after apply)
      + create_time = (known after apply)
      + id          = (known after apply)
      + policy_id   = (known after apply)
      + policy_name = (known after apply)
      + policy_type = (known after apply)
      + user_id     = "example"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

tencentcloud_cam_policy.example: Creating...
tencentcloud_cam_policy.example: Creation complete after 3s [id=29400104]
tencentcloud_cam_role_policy_attachment.example: Creating...
tencentcloud_cam_user_policy_attachment.example: Creating...
tencentcloud_cam_group_policy_attachment.example: Creating...
tencentcloud_cam_role_policy_attachment.example: Creation complete after 4s [id=4611686018427989452#29400104]
tencentcloud_cam_group_policy_attachment.example: Creation complete after 4s [id=99729#29400104]
tencentcloud_cam_user_policy_attachment.example: Creation complete after 4s [id=example#29400104]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

CAM删除role再次apply测试

```
terraform apply
tencentcloud_cam_policy.example: Refreshing state... [id=29400104]
tencentcloud_cam_role.example: Refreshing state... [id=4611686018427989452]
tencentcloud_cam_user.example: Refreshing state... [id=example]
tencentcloud_cam_group.example: Refreshing state... [id=99729]
tencentcloud_cam_user_policy_attachment.example: Refreshing state... [id=example#29400104]
tencentcloud_cam_role_policy_attachment.example: Refreshing state... [id=4611686018427989452#29400104]
tencentcloud_cam_group_membership.example: Refreshing state... [id=99729]
tencentcloud_cam_group_policy_attachment.example: Refreshing state... [id=99729#29400104]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_cam_role.example will be created
  + resource "tencentcloud_cam_role" "example" {
      + console_login = true
      + create_time   = (known after apply)
      + description   = "test"
      + document      = jsonencode(
            {
              + statement = [
                  + {
                      + action    = [
                          + "name/sts:AssumeRole",
                        ]
                      + effect    = "allow"
                      + principal = {
                          + qcs = [
                              + "qcs::cam::uin/100009461222:uin/100009461222",
                            ]
                        }
                    },
                ]
              + version   = "2.0"
            }
        )
      + id            = (known after apply)
      + name          = "example"
      + update_time   = (known after apply)
    }

  # tencentcloud_cam_role_policy_attachment.example will be created
  + resource "tencentcloud_cam_role_policy_attachment" "example" {
      + create_mode = (known after apply)
      + create_time = (known after apply)
      + id          = (known after apply)
      + policy_id   = "29400104"
      + policy_name = (known after apply)
      + policy_type = (known after apply)
      + role_id     = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

tencentcloud_cam_role.example: Creating...
tencentcloud_cam_role.example: Creation complete after 4s [id=4611686018427989452]
tencentcloud_cam_role_policy_attachment.example: Creating...
tencentcloud_cam_role_policy_attachment.example: Creation complete after 3s [id=4611686018427989452#29400104]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```
CAM 删除user测试
```
 terraform apply
tencentcloud_cam_policy.example: Refreshing state... [id=29400104]
tencentcloud_cam_group.example: Refreshing state... [id=99729]
tencentcloud_cam_user.example: Refreshing state... [id=example]
tencentcloud_cam_role.example: Refreshing state... [id=4611686018427989452]
tencentcloud_cam_user_policy_attachment.example: Refreshing state... [id=example#29400104]
tencentcloud_cam_role_policy_attachment.example: Refreshing state... [id=4611686018427989452#29400104]
tencentcloud_cam_group_membership.example: Refreshing state... [id=99729]
tencentcloud_cam_group_policy_attachment.example: Refreshing state... [id=99729#29400104]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_cam_group_membership.example will be created
  + resource "tencentcloud_cam_group_membership" "example" {
      + group_id = "99729"
      + id       = (known after apply)
      + user_ids = (known after apply)
    }

  # tencentcloud_cam_user.example will be created
  + resource "tencentcloud_cam_user" "example" {
      + console_login       = true
      + country_code        = "86"
      + email               = "1234@qq.com"
      + id                  = (known after apply)
      + name                = "example"
      + need_reset_password = true
      + password            = (sensitive value)
      + phone_num           = "13631555963"
      + remark              = "example"
      + secret_id           = (sensitive value)
      + secret_key          = (sensitive value)
      + uid                 = (known after apply)
      + uin                 = (known after apply)
      + use_api             = true
    }

  # tencentcloud_cam_user_policy_attachment.example will be created
  + resource "tencentcloud_cam_user_policy_attachment" "example" {
      + create_mode = (known after apply)
      + create_time = (known after apply)
      + id          = (known after apply)
      + policy_id   = "29400104"
      + policy_name = (known after apply)
      + policy_type = (known after apply)
      + user_id     = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

tencentcloud_cam_user.example: Creating...
tencentcloud_cam_user.example: Creation complete after 3s [id=example]
tencentcloud_cam_user_policy_attachment.example: Creating...
tencentcloud_cam_group_membership.example: Creating...
tencentcloud_cam_group_membership.example: Creation complete after 4s [id=99729]
tencentcloud_cam_user_policy_attachment.example: Creation complete after 4s [id=example#29400104]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
```